joristork/robots/jobot_in_c/microchip_extras/h/p18f4480.h
extern volatile far  unsigned char       RXFBCON1;
extern volatile far  struct {
  unsigned F2BP_0:1;
  unsigned F2BP_1:1;
  unsigned F2BP_2:1;
  unsigned F2BP_3:1;
  unsigned F3BP_0:1;
  unsigned F3BP_1:1;
  unsigned F3BP_2:1;
  unsigned F3BP_3:1;
} RXFBCON1bits;
extern volatile far  unsigned char       RXFBCON2;
extern volatile far  struct {
  unsigned F4BP_0:1;
  unsigned F4BP_1:1;
  unsigned F4BP_2:1;
  unsigned F4BP_3:1;
  unsigned F5BP_0:1;
  unsigned F5BP_1:1;
  unsigned F5BP_2:1;
  unsigned F5BP_3:1;
} RXFBCON2bits;
extern volatile far  unsigned char       RXFBCON3;
extern volatile far  struct {
  unsigned F6BP_0:1;
  unsigned F6BP_1:1;
  unsigned F6BP_2:1;
  unsigned F6BP_3:1;
  unsigned F7BP_0:1;
  unsigned F7BP_1:1;
  unsigned F7BP_2:1;
  unsigned F7BP_3:1;
} RXFBCON3bits;
extern volatile far  unsigned char       RXFBCON4;
extern volatile far  struct {
  unsigned F8BP_0:1;
  unsigned F8BP_1:1;
  unsigned F8BP_2:1;
  unsigned F8BP_3:1;
  unsigned F9BP_0:1;
  unsigned F9BP_1:1;
  unsigned F9BP_2:1;
  unsigned F9BP_3:1;
} RXFBCON4bits;
extern volatile far  unsigned char       RXFBCON5;
extern volatile far  struct {
  unsigned F10BP_0:1;
  unsigned F10BP_1:1;
  unsigned F10BP_2:1;
  unsigned F10BP_3:1;
  unsigned F11BP_0:1;
  unsigned F11BP_1:1;
  unsigned F11BP_2:1;
  unsigned F11BP_3:1;
} RXFBCON5bits;
extern volatile far  unsigned char       RXFBCON6;
extern volatile far  struct {
  unsigned F12BP_0:1;
  unsigned F12BP_1:1;
  unsigned F12BP_2:1;
  unsigned F12BP_3:1;
  unsigned F13BP_0:1;
  unsigned F13BP_1:1;
  unsigned F13BP_2:1;
  unsigned F13BP_3:1;
} RXFBCON6bits;
extern volatile far  unsigned char       RXFBCON7;
extern volatile far  struct {
  unsigned F14BP_0:1;
  unsigned F14BP_1:1;
  unsigned F14BP_2:1;
  unsigned F14BP_3:1;
  unsigned F15BP_0:1;
  unsigned F15BP_1:1;
  unsigned F15BP_2:1;
  unsigned F15BP_3:1;
} RXFBCON7bits;
extern volatile far  unsigned char       MSEL0;
extern volatile far  struct {
  unsigned FIL0_0:1;
  unsigned FIL0_1:1;
  unsigned FIL1_0:1;
  unsigned FIL1_1:1;
  unsigned FIL2_0:1;
  unsigned FIL2_1:1;
  unsigned FIL3_0:1;
  unsigned FIL3_1:1;
} MSEL0bits;
extern volatile far  unsigned char       MSEL1;
extern volatile far  struct {
  unsigned FIL4_0:1;
  unsigned FIL4_1:1;
  unsigned FIL5_0:1;
  unsigned FIL5_1:1;
  unsigned FIL6_0:1;
  unsigned FIL6_1:1;
  unsigned FIL7_0:1;
  unsigned FIL7_1:1;
} MSEL1bits;
extern volatile far  unsigned char       MSEL2;
extern volatile far  struct {
  unsigned FIL8_0:1;
  unsigned FIL8_1:1;
  unsigned FIL9_0:1;
  unsigned FIL9_1:1;
  unsigned FIL10_0:1;
  unsigned FIL10_1:1;
  unsigned FIL11_0:1;
  unsigned FIL11_1:1;
} MSEL2bits;
extern volatile far  unsigned char       MSEL3;
extern volatile far  struct {
  unsigned FIL12_0:1;
  unsigned FIL12_1:1;
  unsigned FIL13_0:1;
  unsigned FIL13_1:1;
  unsigned FIL14_0:1;
  unsigned FIL14_1:1;
  unsigned FIL15_0:1;
  unsigned FIL15_1:1;
} MSEL3bits;
extern volatile far  unsigned char       BSEL0;
extern volatile far  struct {
  unsigned :2;
  unsigned B0TXEN:1;
  unsigned B1TXEN:1;
  unsigned B2TXEN:1;
  unsigned B3TXEN:1;
  unsigned B4TXEN:1;
  unsigned B5TXEN:1;
} BSEL0bits;
extern volatile far  unsigned char       BIE0;
extern volatile far  struct {
  unsigned RXB0IE:1;
  unsigned RXB1IE:1;
  unsigned B0IE:1;
  unsigned B1IE:1;
  unsigned B2IE:1;
  unsigned B3IE:1;
  unsigned B4IE:1;
  unsigned B5IE:1;
} BIE0bits;
extern volatile far  unsigned char       TXBIE;
extern volatile far  struct {
  unsigned :2;
  unsigned TXB0IE:1;
  unsigned TXB1IE:1;
  unsigned TXB2IE:1;
} TXBIEbits;
extern volatile far  unsigned char       B0CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
  struct {
    unsigned :5;
    unsigned RXRTRRO:1;
  };
} B0CONbits;
extern volatile far  unsigned char       B0SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B0SIDHbits;
extern volatile far  unsigned char       B0SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXIDE:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXID:1;
  };
} B0SIDLbits;
extern volatile far  unsigned char       B0EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B0EIDHbits;
extern volatile far  unsigned char       B0EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B0EIDLbits;
extern volatile far  unsigned char       B0DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR_TXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned TXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned RXRTR:1;
  };
} B0DLCbits;
extern volatile far  unsigned char       B0D0;
extern volatile far  struct {
  unsigned B0D00:1;
  unsigned B0D01:1;
  unsigned B0D02:1;
  unsigned B0D03:1;
  unsigned B0D04:1;
  unsigned B0D05:1;
  unsigned B0D06:1;
  unsigned B0D07:1;
} B0D0bits;
extern volatile far  unsigned char       B0D1;
extern volatile far  struct {
  unsigned B0D10:1;
  unsigned B0D11:1;
  unsigned B0D12:1;
  unsigned B0D13:1;
  unsigned B0D14:1;
  unsigned B0D15:1;
  unsigned B0D16:1;
  unsigned B0D17:1;
} B0D1bits;
